[
    {
        "Name": "9th English LA",
        "Code": "01001G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "English/Language Arts I (9th grade) courses build upon students’ prior knowledge of grammar, vocabulary, word usage, and the mechanics of writing and usually include the four aspects of language use: reading, writing, speaking, and listening. Typically, these courses introduce and define various genres of literature, with writing exercises often linked to reading selections.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "9th English LA ADV",
        "Code": "01001E5.0014/24",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "English/Language Arts I (9th grade) courses build upon students’ prior knowledge of grammar, vocabulary, word usage, and the mechanics of writing and usually include the four aspects of language use: reading, writing, speaking, and listening. Typically, these courses introduce and define various genres of literature, with writing exercises often linked to reading selections. This course has more depth and complexity and the pace is faster than English/Language Arts I.",
        "Enjoyment": "5",
        "Difficulty": "7",
        "Workload": "4.5",
        "Reviews": "2"
    },
    {
        "Name": "10th English LA",
        "Code": "01002G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "English/Language Arts II (10th grade) courses usually offer a balanced focus on composition and literature. Typically, students learn about the alternate aims and audiences of written compositions by writing persuasive, critical, and creative multi-paragraph essays and compositions. Through the study of various genres of literature, students can improve their reading rate and comprehension and develop the skills to determine the author’s intent and theme and to recognize the techniques used by the author to deliver his or her message.",
        "Enjoyment": "4",
        "Difficulty": "6",
        "Workload": "7",
        "Reviews": "1"
    },
    {
        "Name": "10th English LA ADV",
        "Code": "01002E5.0014/24",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "English/Language Arts II (10th grade) courses usually offer a balanced focus on composition and literature. Typically, students learn about the alternate aims and audiences of written compositions by writing persuasive, critical, and creative multi-paragraph essays and compositions. Through the study of various genres of literature, students can improve their reading rate and comprehension and develop the skills to determine the author’s intent and theme and to recognize the techniques used by the author to deliver his or her message. This course has more depth and complexity and the pace is faster than English/Language Arts II.",
        "Enjoyment": "5",
        "Difficulty": "4",
        "Workload": "4.5",
        "Reviews": "2"
    },
    {
        "Name": "11th English LA",
        "Code": "01003G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "English/Language Arts III (11th grade) courses continue to develop students’ writing skills, emphasizing clear, logical writing patterns, word choice, and usage, as students write essays and begin to learn the techniques of writing research papers. Students continue to read works of literature, which often form the backbone of the writing assignments. Literary conventions and stylistic devices may receive greater emphasis than in previous courses.",
        "Enjoyment": "3.5",
        "Difficulty": "3.5",
        "Workload": "3.5",
        "Reviews": "2"
    },
    {
        "Name": "AP English Language and Composition (11th Grade)",
        "Code": "1005H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Following the College Board’s suggested curriculum designed to parallel college-level English courses, AP English Language and Composition courses expose students to prose written in a variety of periods, disciplines, and rhetorical contexts. These courses emphasize the interaction of authorial purpose, intended audience, and the subject at hand, and through them, students learn to develop stylistic flexibility as they write compositions covering a variety of subjects that are intended for various purposes.",
        "Enjoyment": "4.5",
        "Difficulty": "10",
        "Workload": "7.5",
        "Reviews": "2"
    },
    {
        "Name": "Senior Literature/Composition/Communications",
        "Code": "01004G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "English/Language Arts IV (12th grade) courses blend composition and literature into a cohesive whole as students write critical and comparative analyses of selected literature, continuing to develop their language arts skills. Typically, students primarily write multi-paragraph essays, but they may also write one or more major research papers.",
        "Enjoyment": "7",
        "Difficulty": "2.5",
        "Workload": "2.5",
        "Reviews": "2"
    },
    {
        "Name": "AP English Literature and Composition (12th Grade)",
        "Code": "1006H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Following the College Board’s suggested curriculum designed to parallel college-level English courses, AP English Literature and Composition courses enable students to develop critical standards for evaluating literature. Students study the language, character, action, and theme in works of recognized literary merit; enrich their understanding of connotation, metaphor, irony, syntax, and tone; and write compositions of their own (including literary analysis, exposition, argument, narrative, and creative writing).",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Mythology",
        "Code": "01069G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Mythology focuses primarily on Greek and Roman myths, yet other cultures such as African, Native American, Asian, and Norse texts are studied at a comparative level. Background information and resources on characteristic themes of world cultures adds emphasis to the individual myths studied. The course emphasizes various myths and legends, plus a study of Homer’s epics the Iliad and/or the Odyssey and Virgil’s Aeneid.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Creative Writing",
        "Code": "01104G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Creative Writing introduces the student to the writing of fiction, poetry, the personal narrative, drama, screenplay, and creative essay. Students analyze peer and published authors for particular stylistic devices in order to understand the writer’s skill in narration, dialogue, description, and detail. This course provides activities and projects to stimulate ideas and extend the students’ writing talent, to encourage appropriate freedom of expression, and to develop sensitivity to the power of words in the written medium. Students read their work aloud for class critique and the course introduces students to appropriate markets for publication.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Film Literature",
        "Code": "05203G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Film Literature examines literary and artistic forms as interpreted through film. Students develop literacy, verbal, and visual analysis skills through discussion and written critiques. This course promotes an understanding of film’s historical progression, its language, its techniques, and its conscious and subliminal effects. This course requires a parent/guardian permission slip.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Public Speaking",
        "Code": "01151G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Public Speaking teaches students the techniques used in informative and persuasive speaking. Students learn the fundamentals of communication and develop skills in the preparation, organization, and presentation of speeches. Students practice and deliver prepared and impromptu speeches to inform, to persuade, and to entertain.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Broadcast Journalism 1",
        "Code": "11103G5.0016/26",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Broadcast Journalism 1 teaches first year Broadcast staff members how to develop an action plan, conduct interviews, write journalistically competent copy, film quality action and B-roll video, and create video segments that include well-edited video, interviews, sound, and graphic elements. Students learn to use professional technology for filming, interviewing, and video editing. Students also learn how to edit and manage digital media files. Students use the Internet and multimedia tools for journalistic research and publishing and study ethical usage guidelines. Students work cooperatively to set and achieve goals, organize time and tasks to meet deadlines, develop and adhere to a budget, and problem-solve in order to publish a product for a school audience. Students learn how to raise money to increase publication funds. Students may enroll more than one year; second and third year students are eligible to become producers and executive producers. In some circumstances, first year students may serve as producers with teacher permission.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Broadcast Journalism 2",
        "Code": "11103G5.0036/46",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Broadcast Journalism 2 is for second year Broadcast students who successfully completed Broadcast 1. Second year staff members continue to develop the skills and knowledge they acquired in Broadcast 1 with a particular emphasis on story design, editing, and graphics. In addition to regular assignments, Broadcast 2 students are also eligible to serve in a leadership position as a producer or in some other capacity where they have additional responsibilities beyond Broadcast 1. Second year staff members who become producers plan coverage for their segments of the Broadcast, design the structure of episodes, coordinate and write scripts for anchors, and work closely with staff to edit and complete each Broadcast episode by deadline. They attend regular Editorial Board meetings, keep detailed and accurate records and lead by example, coaching first year students. They may take the course for a third year where they are eligible to become Executive Producer.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Broadcast Journalism 3",
        "Code": "11103G5.0056/66",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Broadcast Journalism 3 is for third year Broadcast students who successfully completed Broadcast 1 and 2. Third year staff members continue to develop all the skills and knowledge they acquired in Broadcast 1 and 2 with a particular emphasis on coverage, editing, story assignments, sound design, and final production. In addition to regular story assignments, Broadcast 3 students are also eligible to serve in a leadership position, either as a producer, Executive Producer, business manager, or in some other capacity beyond Broadcast 1. A third year staff member who becomes Executive Producer is in charge of all aspects of Broadcast production from the brainstorming of stories to the publishing of the episodes. It is crucial that this person has strong leadership skills including being well-organized, a strong communicator, an expert editor, and a fanatic when it comes to meeting deadlines. Executive Producers may be expected to attend a summer work session to develop and strengthen their skills before school starts in the fall. Executive Producer duties include regularly leading the class and promoting the cohesion of Broadcast staff. Executive Producers work closely with the Media adviser and producers on every aspect of Broadcast production. In addition, the Executive Producer prepares and organizes Broadcast entries into local, state and national competitions.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Pub Prod 1- Yrbook 1",
        "Code": "11104G5.0018/28",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Yearbook 1 allows first year students to learn and practice the skills of yearbook production. First year yearbook staff learn how to develop an action plan, conduct interviews, write journalistically competent copy and captions, take quality action photographs, and complete layouts which include photos and captions, and graphic elements. Students learn to use professional graphic design and photo editing software and supporting technology and how to manage file storage and prepare those files for publication. Students learn ethical and responsible use of Internet resources and practice principles of sound journalism. Students work cooperatively to set and achieve goals, organize time and tasks to meet deadlines, develop and adhere to a budget, and problem-solve in order to publish a product for a school audience. Students may enroll more than one year; second and third year students are eligible to become editors or editors in chief. In some circumstances, first year students may serve as editors with teacher permission.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Pub Prod 2- Yrbook 2",
        "Code": "11104G5.0038/48",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Yearbook 2 allows students who successfully completed Yearbook 1 to continue to develop the skills and knowledge they acquired with a particular emphasis on AP style, design, and graphics. In addition to regular page assignments, Yearbook 2 students are also eligible to serve in a leadership position, either as an editor, business manager, or in some other capacity where they have additional responsibilities beyond Yearbook 1. Second year staff members who become section editors plan coverage for their section of the yearbook, design layouts, and work closely with staff completing pages for their section. They edit and complete their section, producing pages that are ready for publication by deadline. They attend regular editor meetings, keep detailed and accurate records and lead by example, coaching first year students. Second year students who serve successfully for two or more semesters are eligible for an academic letter in Yearbook.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Pub Prod 3- Yrbook 3",
        "Code": "11104G5.0058/68",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Yearbook 3 allows students who successfully completed Yearbook 1 and 2 to continue to develop all the skills and knowledge they acquired with a particular emphasis on planning a ladder, theme development and design, coverage and page assignments, proof-editing and page submission. In addition to regular page assignments, Yearbook 3 students are also eligible to serve in a leadership position, either as an editor, editor-in-chief, business manager, or in some other capacity beyond Yearbook 1. A third year staff member who becomes editor-in-chief is in charge of all aspects of yearbook production from the development of the theme and cover, to the final distribution. It is crucial that this person has strong leadership skills including being well organized, a strong communicator, an expert editor, and a fanatic when it comes to meeting deadlines. EICs may be expected to attend a summer Yearbook work session to develop the theme of the book before school starts in the fall. EICs duties include regularly leading the class and promoting the cohesion of Yearbook staff. EICs work closely with the yearbook adviser and section editors on every aspect of Yearbook production. In addition, the EIC prepares and organizes Yearbook entries into local, state and national competitions. Third year students who serve successfully for two or more semesters are eligible for an academic letter in Yearbook. This is an elective course for practical experience/computer, communication or language arts credit.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Journalism NWSPR",
        "Code": "11101G5.0018/28",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Newspaper 1 teaches first year newspaper staff how to develop an action plan, conduct interviews, write journalistically competent copy and captions, take quality action and candid photographs, and complete layouts that include photos, captions, and graphic elements. Students learn to use professional technology for photo editing, videography, website management, and print layout. Students also learn how to edit and manage digital photos and media files. Students use the Internet and multimedia tools for journalistic research and publishing and study ethical usage guidelines. Students work cooperatively to set and achieve goals, organize time and tasks to meet deadlines, develop and adhere to a budget, and problem-solve in order to publish a product for a school audience. Students learn how to sell ads and raise money to raise publication funds. Students may enroll more than one year; second and third year students are eligible to become editors. In some circumstances, first year students may serve as editors with teacher permission.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Journalism NWSPR 2",
        "Code": "11101G5.0038/48",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Newspaper 2 allows students who successfully completed Newspaper 1 to continue to develop the skills and knowledge they acquired with a particular emphasis on AP style, design, and graphics. In addition to regular page assignments, Newspaper 2 students are also eligible to serve in a leadership position, either as an editor, business manager, or in some other capacity where they have additional responsibilities beyond Newspaper 1. Second year staff members who become section editors plan coverage for their section of the Newspaper, design layouts, and work closely with staff completing pages for their section. They edit and complete their section, producing pages that are ready for publication by deadline. They attend regular editor meetings, keep detailed and accurate records and lead by example, coaching first year students. Second year students who serve successfully for two or more semesters are eligible for an academic letter in Newspaper.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Journalism NWSPR 3",
        "Code": "11101G5.0058/68",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Newspaper 3 allows students who have successfully completed Newspaper 1 and 2 to continue to develop the skills and knowledge they acquired with emphasis on planning coverage and page assignments, coaching junior staff, and advanced work with publishing technologies. In addition to regular reporting assignments, Newspaper 3 students are eligible to serve in a leadership position, such as an editor, editor-in-chief, or business manager. A staff member who becomes editor-in- chief is in charge of all elements of news production and promotes high journalism standards. The EIC must have strong leadership skills in organization, deadlines, communication, and editing. EICs may be expected to summer work sessions. EIC duties include regularly leading the class and promoting cohesion of newspaper staff. In addition, the EIC prepares and organizes newspaper entries into local, state and national competitions.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Video & Film 1",
        "Code": "11055G5.0012",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Video and Film Production provides opportunities for students to write, produce, and edit video and film using digital SLR cameras and industry standard editing through Adobe Premiere Pro. Students are responsible for planning, handling technical equipment, and employing technical knowledge in order to create a variety of types of films including music videos, documentaries, dramas, and comedies. The final project allows students to create a longer film suitable for submission to film festivals.",
        "Enjoyment": "10",
        "Difficulty": "2",
        "Workload": "2.3",
        "Reviews": "3"
    },
    {
        "Name": "Video & Film 2",
        "Code": "11055G5.0022",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Video and Film Production 2 is a semester-long course that requires students to write, act and produce films, many of which will be showcased through music and theater events, television and the year-end film festival. This course is also an opportunity to create polished portfolio pieces for the college application process. Students use a variety of more sophisticated filming techniques including use of a boom microphone, aerial drone, motorized slider, umbrella lighting, and steady-cam/gimbal. Students who have acting experience also have the opportunity to act as recurring characters in a sit-com produced by students for broadcast.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Algebra 1",
        "Code": "02052G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Algebra I courses include the study of properties and operations of the real number system; evaluating rational algebraic expressions; solving and graphing first-degree equations and inequalities; translating word problems into equations; operations with and factoring of polynomials; solving quadratic equations; and modeling linear data. Specific content depends upon state standards.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Algebra 2",
        "Code": "02056G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Algebra I & Geometry",
        "Summary": "Algebra II course topics typically include developing an understanding of the relationships between the symbolic, graphic, tabular and verbal representations of functions; utilizing the various representations to interpret function behavior and solve equations; operations with rational and irrational expressions; factoring of rational expressions; in-depth study of linear equations and inequalities; quadratic equations; solving systems of linear and quadratic equations; graphing of constant, linear, and quadratic equations; properties of higher-degree equations; exponential functions; inverse functions; statistical modeling; modeling linear and quadratic data; and operations with rational and irrational exponents.",
        "Enjoyment": "3.5",
        "Difficulty": "6.5",
        "Workload": "7.5",
        "Reviews": "2"
    },
    {
        "Name": "ADV Algebra 2",
        "Code": "02056E5.0014/24",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Adv Geometry",
        "Summary": "Algebra II course topics typically include developing an understanding of the relationships between the symbolic, graphic, tabular and verbal representations of functions; utilizing the various representations to interpret function behavior and solve equations; operations with rational and irrational expressions; factoring of rational expressions; in-depth study of linear equations and inequalities; quadratic equations; solving systems of linear and quadratic equations; graphing of constant, linear, and quadratic equations; properties of higher-degree equations; exponential functions; inverse functions; statistical modeling; modeling linear and quadratic data; and operations with rational and irrational exponents. The pace of an advanced course may be faster than that of the Algebra 1 course.",
        "Enjoyment": "7.5",
        "Difficulty": "4.5",
        "Workload": "6.5",
        "Reviews": "2"
    },
    {
        "Name": "Geometry",
        "Code": "02072G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Algebra I",
        "Summary": "Geometry courses, emphasizing an abstract, formal approach to the study of geometry, typically include topics such as properties of plane and solid figures; deductive methods of reasoning and use of logic; geometry as an axiomatic system including the study of postulates, theorems, and formal proofs; concepts of congruence, similarity, parallelism, perpendicularity, and proportion; and rules of angle measurement in triangles, quadrilaterals, vertical angles, lines intersected by a transversal, etc.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "ADV Geometry",
        "Code": "02072E5.0014/24",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Algebra I",
        "Summary": "Geometry courses, emphasizing an abstract, formal approach to the study of geometry, typically include topics such as properties of plane and solid figures; deductive methods of reasoning and use of logic; geometry as an axiomatic system including the study of postulates, theorems, and formal proofs; concepts of congruence, similarity, parallelism, perpendicularity, and proportion; and rules of angle measurement in triangles, quadrilaterals, vertical angles, lines intersected by a transversal, etc. The pace of an advanced course may be faster than that of the Geometry course.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Pre Calculus",
        "Code": "02110G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Algebra 2",
        "Summary": "Mathematics at the Pre-Calculus level focuses on exponential, logarithmic, and trigonometric functions, conic sections, systems of equations solved by matrices and limits of functions as a precursor to the study of Calculus. Problem solving, representations, reasoning, communication, and connections within and outside of mathematics underline all of the teaching and learning at the Pre-Calculus level.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "ADV Pre Calculus 2",
        "Code": "02110E5.0034/44",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Algebra 2 Adv",
        "Summary": "Mathematics at the Advanced Pre-Calculus level focuses on solving and modeling with exponential, logarithmic, parametric and trigonometric functions and their inverses. The complex number system is fully developed. Conic sections, systems of equations solved through matrices, and an introduction to vectors and sequences and series are also included. Limits of functions are taught as a precursor to Calculus AB or BC. Problem solving, representations, reasoning, communication, and connections within and outside of mathematics underline all of the teaching and learning at the Pre-Calculus level. As an advanced course, this course goes beyond the curriculum expectations of the Pre-Calculus course offering by increasing the depth and complexity. Students are engaged in dynamic, high-level learning via the Standards for Mathematical Practice. The pace of an advanced course may be faster than that of the Pre-Calculus course.",
        "Enjoyment": "4",
        "Difficulty": "8",
        "Workload": "6.5",
        "Reviews": "2"
    },
    {
        "Name": "AP Calculus AB",
        "Code": "02124H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Pre-Calculus",
        "Summary": "Following the College Board’s suggested curriculum designed to parallel college-level calculus courses, AP Calculus AB provides students with an understanding of the concepts of calculus and experience with its methods and applications. These courses introduce calculus and include the following topics: functions, graphs, limits, and continuity; differential calculus (including definition, application, and computation of the derivative; derivative at a point; derivative as a function; and second derivatives); and integral calculus (including definite integrals and antidifferentiation).",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "AP Calculus BC",
        "Code": "02125H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Adv Pre-Calculus",
        "Summary": "Following the College Board’s suggested curriculum designed to parallel college-level calculus courses, AP Calculus BC courses provide students with an understanding of the concepts of calculus and experience with its methods and applications. These courses cover all of the calculus topics in AP Calculus AB as well as the following topics: parametric, polar, and vector functions; applications of integrals; and polynomial approximations and series, including series of constants and Taylor series. See SCED Code 02124 for more details.",
        "Enjoyment": "6",
        "Difficulty": "8",
        "Workload": "7.5",
        "Reviews": "2"
    },
    {
        "Name": "AP Statistics",
        "Code": "02203H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Algebra 2",
        "Summary": "Following the College Board's suggested curriculum designed to parallel college-level statistics courses, AP Statistics courses introduce students to the major concepts and tools for collecting, analyzing, and drawing conclusions from data. Students are exposed to four broad conceptual themes: exploring data, sampling and experimentation, anticipating patterns, and statistical inference.",
        "Enjoyment": "4",
        "Difficulty": "2",
        "Workload": "4",
        "Reviews": "1"
    },
    {
        "Name": "Discrete Math",
        "Code": "02102G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Geometry",
        "Summary": "Discrete Mathematics courses include the study of topics such as number theory, discrete probability, set theory, symbolic logic, Boolean algebra, combinatorics, recursion, basic algebraic structures and graph theory.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Problem Solving",
        "Code": "02149G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Geometry",
        "Summary": "This course will focus on strengthening problem solving skills by introducing multiple strategies and encouraging collaborative problem-solving amongst students. It is designed around the Standards for Mathematical Practice, with the most common problem-solving strategies as the focal point for instruction. Written and oral communication of strategies and solutions is expected. Students will communicate problem solving techniques and solutions in group work, presentations, and writing.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Statistics",
        "Code": "02205G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Geometry",
        "Summary": "Statistics courses involve the major concepts and methods used to collect, analyze, and draw conclusions from data. Topics typically include populations and samples, measures of central tendency and variability, hypothesis testing, presentation, and making statistical inferences.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Biology",
        "Code": "03051G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "In this class, students will explore relationships between structure and function in organisms and the interaction of cells and organisms with each other and their environments. Topics of study include: use of a microscope, cell structure and function, biochemistry, microbiology, classification, human physiology, genetics, evolution, botany and ecology. Laboratory activities reinforce concepts presented and engage students in the practices of scientific inquiry.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "ADV Biology",
        "Code": "03052E5.0014/24",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "In this class, students will explore relationships between structure and function in organisms and the interaction of cells and organisms with each other and their environments. Topics of study include: use of a microscope, cell structure and function, biochemistry, microbiology, classification, human physiology, genetics, evolution, botany and ecology. Laboratory activities reinforce concepts presented and engage students in the practices of scientific inquiry. As an advanced course, this course goes beyond the curriculum expectations of a standard course offering by increasing the depth and complexity. Students are engaged in dynamic, high-level learning. The pace of an advanced course may be faster than that of a “standard” course.",
        "Enjoyment": "7",
        "Difficulty": "4",
        "Workload": "5",
        "Reviews": "1"
    },
    {
        "Name": "AP Biology",
        "Code": "03056H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Biology, Adv Biology or Adv Chemistry",
        "Summary": "Adhering to the curricula recommended by the College Board and designed to parallel college-level introductory biology courses, AP Biology courses emphasize four general concepts: evolution; cellular processes (energy and communication); genetics and information transfer; and interactions of biological systems. For each concept, these courses emphasize the development of scientific inquiry and reasoning skills, such as designing a plan for collecting data, analyzing data, applying mathematical routines, and connecting concepts in and across domains. AP Biology courses include college-level laboratory investigations.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Anatomy & Physiology ADV",
        "Code": "03053E5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Biology or Adv Biology",
        "Summary": "Usually taken after a comprehensive initial study of biology, Anatomy and Physiology courses present the human body and biological systems in more detail. In order to understand the structure of the human body and its functions, students learn anatomical terminology, study cells and tissues, explore functional systems (skeletal, muscular, circulatory, respiratory, digestive, reproductive, nervous, and so on), and may dissect mammals. The pace of an advanced course may be faster than that of a “standard” course.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "ADV Chemistry",
        "Code": "03101E5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Algebra I and Biology or Adv Biology",
        "Summary": "Chemistry courses involve studying the composition, properties, and reactions of substances. These courses typically explore such concepts as the behaviors of solids, liquids, and gasses; acid/base and oxidation/reduction reactions; and atomic structure. Chemical formulas and equations and nuclear reactions are also studied.The pace of an advanced course may be faster than that of a “standard” course.",
        "Enjoyment": "7",
        "Difficulty": "4",
        "Workload": "6",
        "Reviews": "2"
    },
    {
        "Name": "AP Chemistry",
        "Code": "03106H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Adv Chem",
        "Summary": "Following the curricula recommended by the College Board, AP Chemistry courses usually follow high school chemistry and second-year algebra. Concepts covered may include the structure of matter; bonding of intermolecular forces; chemical reactions; kinetics; thermodynamics; and chemical equilibrium. For each concept, these courses emphasize the development of scientific inquiry and reasoning skills, such as designing a plan for collecting data, analyzing data, applying mathematical routines, and connecting concepts in and across domains. AP Chemistry courses include college-level laboratory investigations. It is recommended to also be enrolled or already taken in Algebra 2.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "ADV Physics",
        "Code": "03151E5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Algebra 2",
        "Summary": "Physics courses involve the study of the forces and laws of nature affecting matter, such as equilibrium, motion, momentum, and the relationships between matter and energy. The study of physics includes examination of sound, light, and magnetic and electric phenomena. The pace of an advanced course may be faster than that of a “standard” course. It is recommended to also be enrolled or already taken in PreCalculus.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "AP Physics C",
        "Code": "03156H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "AP Physics C courses prepare students for the College Board’s examinations in Physics C: Electricity and Magnetism and Physics C: Mechanics. These courses parallel college-level physics courses that serve as a partial foundation for science or engineering majors and primarily focus on mechanics and electricity and magnetism, with approximately equal emphasis placed on these two areas. See SCED Codes 03163 and 03164 for detailed content descriptions. It is recommended to also be enrolled or already taken in Calculus.",
        "Enjoyment": "6",
        "Difficulty": "5",
        "Workload": "3.3",
        "Reviews": "3"
    },
    {
        "Name": "AP Environmental Science",
        "Code": "03207H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Biology, Adv Biology, Earth/Space or Adv Chemistry",
        "Summary": "AP Environmental Science courses are designed by the College Board to provide students with the scientific principles, concepts, and methodologies required to understand the interrelationships of the natural world, identify and analyze environmental problems (both natural and human made), evaluate the relative risks associated with the problems, and examine alternative solutions for resolving and/or preventing them. Topics covered include science as a process, ecological processes and energy conversions, earth as an interconnected system, the impact of humans on natural systems, cultural and societal contexts of environmental problems, and the development of practices that will ensure sustainable systems.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Research Seminar in Science",
        "Code": "03212E5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Adv Physics, Engineering, Statistics or Computer Programming",
        "Summary": "In Scientific Research and Design courses, students conceive of, design, and complete a project using scientific inquiry and experimentation methodologies. Emphasis is typically placed on safety issues, research protocols, controlling or manipulating variables, data analysis, and a coherent display of the project and its outcome(s).",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Marine Science",
        "Code": "03005G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Biology or Adv Biology",
        "Summary": "Courses in Marine Science focus on the content, features, and possibilities of the earth’s oceans. They explore marine organisms, conditions, and ecology and sometimes cover marine mining, farming, and exploration.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Earth Space Geo Physical Science",
        "Code": "03008G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Algebra I",
        "Summary": "Earth and Space Science courses introduce students to the study of the earth from a local and global perspective. In these courses, students typically learn about time zones, latitude and longitude, atmosphere, weather, climate, matter, and energy transfer. Advanced topics often include the study of the use of remote sensing, computer visualization, and computer modeling to enable earth scientists to understand earth as a complex and changing planet.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Biotechnology",
        "Code": "14252G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Biology or Adv Biology",
        "Summary": "Description coming soon…",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "World Geography",
        "Code": "04001G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "World Geography courses provide students with an overview of world geography, but may vary widely in the topics they cover. Topics typically include the physical environment; the political landscape; the relationship between people and the land; economic production and development; and the movement of people, goods, and ideas.",
        "Enjoyment": "7",
        "Difficulty": "4",
        "Workload": "4",
        "Reviews": "1"
    },
    {
        "Name": "AP Human Geography",
        "Code": "04004H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Following the College Board’s suggested curriculum designed to parallel college-level Human Geography courses, AP Human Geography introduces students to the systematic study of patterns and processes that have shaped the ways in which humans understand, use, and alter the earth’s surface. Students use spatial concepts and landscape analysis to examine human social organization and its environmental consequences and also learn about the methods and tools geographers use in their science and practice.",
        "Enjoyment": "8",
        "Difficulty": "5",
        "Workload": "6",
        "Reviews": "1"
    },
    {
        "Name": "World History",
        "Code": "04051G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "World History—Overview courses provide students with an overview of the history of human society from early civilization to the contemporary period, examining political, economic, social, religious, military, scientific, and cultural developments. World History—Overview courses may include geographical studies, but often these components are not as explicitly taught as geography.",
        "Enjoyment": "7",
        "Difficulty": "4",
        "Workload": "2",
        "Reviews": "1"
    },
    {
        "Name": "AP World History",
        "Code": "04067H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Following the College Board’s suggested curriculum designed to parallel college-level World History courses, AP World History: Modern courses examine world history from 1200 CE to the present with the aim of helping students make connections of historical evolution across times and places. These courses highlight the interaction between humans and the environment; development and interaction of cultures; state-building, expansion and conflict; creation, expansion and interaction of economic systems; development and transformation of social structures; and technology and innovation.",
        "Enjoyment": "7",
        "Difficulty": "6",
        "Workload": "3",
        "Reviews": "1"
    },
    {
        "Name": "US History",
        "Code": "04101G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "U.S. History—Comprehensive courses provide students with an overview of the history of the United States, examining time periods from discovery or colonialism through World War II or after. These courses typically include a historical overview of political, military, scientific, and social developments. Course content may include a history of the North American peoples before European settlement.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "AP US History",
        "Code": "04104H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Following the College Board’s suggested curriculum designed to parallel college-level U.S. History courses, AP U.S. History courses provide students with the analytical skills and factual knowledge necessary to address critical problems and materials in U.S. history. Students learn to assess historical materials and to weigh the evidence and interpretations presented in historical scholarship. The course examines the discovery and settlement of the New World through the recent past.",
        "Enjoyment": "7.5",
        "Difficulty": "6",
        "Workload": "3.5",
        "Reviews": "2"
    },
    {
        "Name": "AP European History",
        "Code": "04056H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Following the College Board’s suggested curriculum designed to parallel college-level European History courses, AP European History courses examine European civilization in four chronological periods, from 1450 to the present, and also expose students to the factual narrative. In addition, these courses help students develop an understanding of some of the principal themes in modern European history and the abilities to analyze historical evidence and to express that understanding and analysis in writing.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "US Government",
        "Code": "04151G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "U.S. Government—Comprehensive courses provide an overview of the structure and functions of the U.S. government and political institutions and examine constitutional principles, the concepts of rights and responsibilities, the role of political parties and interest groups, and the importance of civic participation in the democratic process. These courses may examine the structure and function of state and local governments and may cover certain economic and legal topics.",
        "Enjoyment": "7",
        "Difficulty": "3",
        "Workload": "3",
        "Reviews": "1"
    },
    {
        "Name": "Current World Affairs",
        "Code": "04156G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "United States and World Affairs courses provide a study of global interrelationships. Topics covered may include geographic, political, economic, and social issues of a particular country or region, with an emphasis on how these issues influence (or are influenced by) the way in which the United States relates to other countries in an interdependent world context.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "AP US Government and Politics",
        "Code": "04157H5.0011",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Following the College Board’s suggested curriculum designed to parallel college-level U.S. Government and Politics courses, these courses provide students with an analytical perspective on government and politics in the United States, involving both the study of general concepts used to interpret U.S. politics and the analysis of specific case studies and foundational documents. The courses generally cover foundations of American democracy, interaction among branches of government, political beliefs and behaviors, political participation, and civil rights and liberties.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Economics",
        "Code": "04201G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Economics courses provide students with an overview of economics with primary emphasis on the principles of microeconomics and the U.S. economic system. These courses may also cover topics such as principles of macroeconomics, international economics, and comparative economics. Economic principles may be presented in formal theoretical contexts, applied contexts, or both.",
        "Enjoyment": "7",
        "Difficulty": "5",
        "Workload": "7",
        "Reviews": "1"
    },
    {
        "Name": "Anthropology",
        "Code": "04251G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Anthropology courses introduce students to the study of human evolution with regard to the origin, distribution, physical attributes, environment, and culture of human beings. These courses provide an overview of anthropology, including but not limited to both physical and cultural anthropology.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Psychology",
        "Code": "04254G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Psychology courses introduce students to the study of individual human behavior. Course content typically includes (but is not limited to) an overview of the field of psychology, topics in human growth and development, personality and behavior, and abnormal psychology.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "AP Psychology",
        "Code": "04256H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Psychology",
        "Summary": "Following the College Board’s suggested curriculum designed to parallel a college-level introductory psychology course, AP Psychology courses introduce students to the systematic and scientific study of the behavior and mental processes of human beings and other animals, expose students to each major subfield within psychology, and enable students to examine the methods and ethics that psychologists use in their science and practice.",
        "Enjoyment": "3",
        "Difficulty": "9",
        "Workload": "9",
        "Reviews": "1"
    },
    {
        "Name": "Sociology",
        "Code": "04258G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Sociology courses introduce students to the study of human behavior in society. These courses provide an overview of sociology, generally including (but not limited to) topics such as social institutions and norms, socialization and social change, and the relationships among individuals and groups in society.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Understanding Diversity",
        "Code": "04259G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Understanding Diversity in the United States is a course designed to give students the opportunity to examine the full range of diverse peoples in the United States and their role in society. Students will engage in research and discussion about the nature and impact of discrimination in our country and how oppression has changed over time. Students will examine narratives of representative groups as well as missing history and social invisibility. Students will examine oppression on an individual, organizational and societal level and judge the impact of these systems on target groups as well as themselves.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Band 1",
        "Code": "05101G5.0016/26",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Band Level 1 is a course that emphasizes the organization, preparation, and performance of a variety of band music. The yearlong course will explore both the marching and concert bands. Included in the course is the study of those basic musical and physical coordination skills for band performances. In addition, a variety of group and individual leadership programs are presented. Public performances after school hours are an integral part of the course and are required.",
        "Enjoyment": "4",
        "Difficulty": "4",
        "Workload": "4",
        "Reviews": "1"
    },
    {
        "Name": "Band 2",
        "Code": "05101G5.0036/46",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Band Level 2 is a course that further explores the organization, preparation, and performance concepts of a contemporary band. The yearlong course will further explore both the marching and concert band idioms. Included is the study of more intricate music and both affective and physical coordination skills necessary for band performances. In addition, a variety of group and individual leadership positions will be available. Public performance after school hours is an integral part of the course and is required.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Band 3",
        "Code": "05101G5.0056/66",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Band Level 3 is a course that emphasizes the highest degree of band performance. Level 3 students assume many of the varied responsibilities of organizing the band and rehearsals. The yearlong course will further explore some of the most complex aspects of a performing band program. In addition, special opportunities are given for leadership training. Public performances after school hours are an integral part of the course and are required.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Chamber Orchestra",
        "Code": "05104E5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Students in this course build on skills and concepts learned in previous years. Students will focus on playing longer and more difficult pieces of music (grade 2.5-3 on a scale of 1-6) and the skills needed to become an effective soloist. Students will continue to expand their musical experience through creation, theory and aesthetic valuation. Culminating performances are a meaningful component of this full year course.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Orchestra 1",
        "Code": "05104G5.0016/26",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Orchestra Level 1 offers technical and musical training and opportunities for development in-group settings for orchestral musicians. Students become familiar with great works of music as well as developing technical and personal growth. Winds and percussion may be incorporated to provide for a full orchestral experience. Performances after school hours are an integral part of the course and are required.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Orchestra 2",
        "Code": "05104G5.0036/46",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Orchestra Level 2 offers technical and musical training at an advancing level and opportunities for development in-group settings for orchestral musicians. Students become familiar with great works of music as well as developing technical and personal growth. Winds and percussion may be incorporated to provide for a full orchestral experience. Performances after school hours are an integral part of the course and are required.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Orchestra 3",
        "Code": "05104G5.0056/66",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Orchestra Level 3 offers technical and musical training and opportunities for development in-group settings for orchestral musicians. Students become familiar with great works of music as well as developing technical and personal growth. Winds and percussion may be incorporated to provide for a full orchestral experience. Public performances after school hours are an integral part of the course and are required.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Jazz Band 1",
        "Code": "05106G5.0016/26",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Jazz Band 1 is a course that offers student musicians experience in and opportunity to perform the musical forms of jazz, rock, and popular music with additional emphasis on advancing improvisational techniques. Public performances after school hours are an integral part of the course and are required.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Jazz Band 2",
        "Code": "05106G5.0036/46",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Jazz Band 2 is a course that offers student musicians experience in and opportunity to perform the musical forms of jazz, rock, and popular music with additional emphasis on advancing improvisational techniques. Public performances after school hours are an integral part of the course and are required.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Jazz Band 3",
        "Code": "05106G5.0056/66",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Jazz Band 3 is a course that offers student musicians experience in and opportunity to perform the musical forms of jazz, rock, and popular music with additional emphasis on advancing improvisational techniques. Public performances after school hours are an integral part of the course and are required.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Select S/A/T/B Choir",
        "Code": "05110E5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Select Soprano/Alto/Tenor/Bass Choir is a more advanced ensemble focusing on more difficult choral works. Emphasis will be placed on developing more advanced musicianship and professionalism. A wide variety of advanced vocal and choral techniques will be explored in-depth. Culminating performances are a meaningful and mandatory component of this class.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "S/A/T/B Choir",
        "Code": "05110G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Soprano/Alto/Tenor/Bass Choir is a vocal ensemble designed to introduce singers to choral ensembles at the high school level. A wide variety of vocal techniques will be presented and utilized. Culminating performances are a meaningful and mandatory component of this class.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Select S/A Choir",
        "Code": "05111E5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Select Soprano/Alto Choir is a more advanced ensemble focusing on more difficult choral works. Emphasis will be placed on developing more advanced musicianship and professionalism. A wide variety of advanced vocal and choral techniques will be explored in-depth. Culminating performances are a meaningful and mandatory component of this class.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "S/A Choir",
        "Code": "05111G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Soprano/Alto Choir builds on the skills and concepts from all prior levels. Emphasis will be placed on developing more advanced musicianship and professionalism. A wide variety of advanced vocal and choral techniques will be explored in-depth. Culminating performances are a meaningful and mandatory component of this class.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Show Choir",
        "Code": "05149G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Show Choir focuses on the performance of vocal music in the popular idiom. Emphasis will be placed on developing appropriate vocal techniques and stage presence to create an effective overall performance. Culminating performances are a meaningful and mandatory component of this class.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "AP Music Theory",
        "Code": "05114H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "AP Music Theory courses are designed to be the equivalent of a first-year music theory college course as specified by the College Board. AP Music Theory develops students’ understanding of musical structure and compositional procedures. Usually intended for students who already possess performance-level skills, AP Music Theory courses extend and build upon students’ knowledge of intervals, scales, chords, metric/rhythmic patterns, and the ways they interact in a composition. Musical notation, analysis, composition, and aural skills are important components of the course.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "AP Art History",
        "Code": "05153H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Designed to parallel college-level Art History courses, AP Art History courses provide the opportunity for students to critically examine and respond to works of art within their historical and cultural contexts. In covering the art and movements of several centuries (not necessarily in chronological order), students learn to identify different styles, techniques, media and influences. Students formulate and articulate their reactions to various kinds of artwork to understand and appreciate themselves, others, and the world around them.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "AP Art Design",
        "Code": "05174H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "AP 2-D Art and Design courses are designed for students with a professional or academic interest in two-dimensional art. These courses focus on a variety of concepts and approaches in drawing and 2-D design, enabling students to demonstrate a range of abilities and versatility with media, technique, problem solving, and scope. Such conceptual variety can be demonstrated through the use of one or several media. Students refine their skills and create artistic works to submit via a portfolio to the College Board for evaluation.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Theatre 1",
        "Code": "05053G5.0013",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Theatre 1 provides a foundation in all aspects of theatre: history, play analysis, terminology, stage movement, vocal exercises, memorization, character interpretation, production principles, and selection and evaluation of plays.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Unified Theatre",
        "Code": "N/A",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "This course is designed for students with special physical needs. The programs are adaptive in nature and very individualized so that the students can work on their specific needs. Students will increase their skill level in their areas of interest, along with participation in various types of conditioning activities. This course also provides students with the opportunity to participate in modified activities in an environmental education class. This semester course may be repeated as desired or recommended. Mentor students are also able to register. A Mentor Application will be required prior to the start of the class.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Improv Performance",
        "Code": "05999G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Improvised Performance provides opportunities for students to develop and practice performance skills such as projection, articulation, audience awareness, connected action and reaction. Character development, expression, imagination and appreciation of group dynamics are also emphasized. Students focus on various improvised performance styles and demonstrate their learning through multiple public performances.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Stagecraft 1",
        "Code": "05056G5.0012",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Stagecraft teaches students the skills and concepts essential to stagecraft, and technical theatre. Students engage daily in hands-on activities that revolve around scenic design, theatrical management, and construction techniques. Through collaborative learning, individual and group projects, and critical analysis students develop advanced qualities of leadership, and responsibility.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Guitar 1",
        "Code": "05108G5.0012",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Guitar courses provide students an introduction to, and refine the fundamentals of, music and guitar literature and techniques, such as strumming and chords and may offer instruction in more advanced techniques. These courses may include bass, ukulele and other plucked string instruments. Formal and informal performances are typically included as well as experiences in creating and responding to music.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Pop Music Recording Tech",
        "Code": "05123G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Recording and Production courses provide students with an opportunity to learn and apply skills in music recording techniques, music editing, mixing, and creating finished musical recordings for distribution as sound files in order to enhance, convey, and capture the expressive intent of music.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Draw Paint 1",
        "Code": "05155G5.0014",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Students can expect to gain a strong foundation in drawing and painting in this beginning level class. Composition, the visual element, the principles of design, and the basic techniques and concepts of both drawing and painting will be covered. The end goals are to increase artistic self-confidence, increase one’s understanding of the basics of drawing /painting and to produce successful works.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Draw Paint 2",
        "Code": "05155G5.0024",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Draw Paint 1",
        "Summary": "This second level course builds upon the experiences of Drawing and Painting 1. Students who choose to take this course should be confident with their drawing skills and ready to produce more complex finished drawings and paintings. An emphasis will be on the development of a more personal style, sophisticated approaches to the development of ideas, development of a greater awareness of art beyond school, and the introduction of new techniques.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Draw Paint 3",
        "Code": "05155G5.0034",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Draw Paint 2",
        "Summary": "This third level more advanced class builds upon the drawing and painting experiences of level 2. The class will provide opportunities to expand drawing, painting and related skills; to develop a personal style; to develop creative ideas; to expand one’s awareness to art beyond school, and to provide instruction based on a student’s art or career goals when desired. Proficiency in skills will be expected.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Draw Paint 4",
        "Code": "05155G5.0044",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Draw Paint 3",
        "Summary": "This fourth level advanced course gives students an additional opportunity to produce drawings, paintings, and related works for a portfolio. The class will provide opportunities to expand drawing, painting and related skills; to develop a personal style; to develop creative ideas; to expand one’s awareness to art beyond school, and to provide instruction based on a student’s particular art or career goals when desired. Proficiency in basic skills will be expected.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Ceramics/Pottery 1",
        "Code": "05159G.0014",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "This is a foundation course that emphasizes the art elements and principles of design to produce nonfunctional and functional three-dimensional art forms constructed from clay. Students may explore both functional and nonfunctional forms using hand-building, the potter’s wheel, and various other sculptural techniques. Students will be exposed to contemporary and historical clay artists.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Ceramics/Pottery 2",
        "Code": "05159G.0024",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Pottery 1",
        "Summary": "This second level course will build upon experiences in Pottery/Sculpture 1. Students will be challenged with more advanced techniques and problems in the area of pottery and sculpture to create both functional and nonfunctional three-dimensional forms. Students may explore in greater depth the process of hand-building, the potter’s wheel, and other sculptural techniques. New firing techniques, different clay bodies, new glazes and new sculpture techniques may be introduced. Students will be exposed to contemporary and historical clay artists.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Ceramics/ Pottery 3",
        "Code": "05159G.0034",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Pottery 2",
        "Summary": "This third level course will build upon experiences in level 2. Students will be challenged with more advanced techniques and problems in the area of pottery and sculpture to create both functional and nonfunctional three-dimensional forms. Students may explore in greater depth the process of hand-building, the potter’s wheel, sculptural techniques, firing techniques, clay bodies, glazes and sculpture techniques. Students will be exposed to contemporary and historical clay artists.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Ceramics/ Pottery 4",
        "Code": "05159G.0044",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Pottery 3",
        "Summary": "This fourth level course will build upon experiences in level 3. Students will be challenged with more advanced techniques and problems in the area of pottery and sculpture to create both functional and nonfunctional three-dimensional forms. Students will refine techniques and increase skill levels. Students may explore in greater depth the process of hand-building, the potter’s wheel, sculptural techniques, firing techniques, clay bodies, glazes and sculpture techniques. Some possible media to be used are clay, wood, papier-mâché, fibers, found objects, yarns, plaster and others.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Film Photography 1",
        "Code": "05167G5.0014",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "This introductory course deals with traditional black and white 35mm as well as digital photography and teaches the basic camera handling, film processing, and darkroom procedures. Students learn how to control light to produce an aesthetically pleasing image. Composition and the elements and principles of art are introduced. In addition, pinhole cameras, photograms, special effects, and the history of photography may be addressed.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Film Photography 2",
        "Code": "05167G5.0024",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Photography 1",
        "Summary": "This second level course will build upon experiences of level 1. This course deals with improving the student’s ability to see, take and create a photographic image. Students may be given opportunities to work with sepia toning, hand coloring, multiple images, special films, digital images, and other photo techniques and processes. Masters of photography may be studied. Special emphasis is placed on the critique.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Film Photography 3",
        "Code": "05167G5.0034",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Photography 2",
        "Summary": "This third level course will build upon experiences of level 2. This course deals with improving the student’s ability to see, take and create a photographic image. Students may be given opportunities to work with medium format, sepia toning, hand coloring, multiple images, special films, digital images, specialty lenses, filters and other photo techniques and processes. Masters of photography may be studied. Large photo printing may be taught.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Film Photography 4",
        "Code": "05167G5.0044",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Photography 3",
        "Summary": "This fourth level course will build upon experiences of level 3 to expand darkroom and photo taking skills and increase the confidence of the students as photographers. Students may be given opportunities to work with medium format, sepia toning, hand coloring, multiple images, special films, digital images, specialty lenses, filters and other photo techniques and processes. Masters of photography may be studied. Some instruction may be given on an individual basis with the student’s particular career goals or artistic vision in mind.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Digital Art & Design 1",
        "Code": "05169G5.0013",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "This introductory course deals with controlling computer technology to produce an artistic image. Students will learn computer illustration techniques, image manipulation, digital camera use, graphic design, 3D modeling, motion graphics, video & audio editing, art history, visual literacy and the principles and elements of art in composition.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Digital Art & Design 2",
        "Code": "05169G5.0023",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Digital Art & Design 1",
        "Summary": "This course extends the fundamental concepts and skills of Digital Art and Design 1 of using computer technology to produce an artistic image. Students will further advance their computer illustration techniques, image manipulation, Blog design, digital camera use, graphic design knowledge, 3D modeling, motion graphics, video & audio editing, art history concepts, visual literacy and the principles and elements of art in composition.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Digital Art & Design 3",
        "Code": "05169G5.0033",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Digital Art & Design 2",
        "Summary": "This course will be the natural progression of Digital Art and Design 1 & 2 as it continues the fundamental idea of using computer technology to produce an artistic image. Students will further advance their computer illustration techniques, image manipulation, digital camera use, and graphic design knowledge, 3D modeling, motion graphics, video & audio editing, art history concepts, visual literacy and the principles and elements of art in composition.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Portfolio Arts 1",
        "Code": "05170G5.0014",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Digital Art & Design 3",
        "Summary": "This course is imperative for the student who is preparing a portfolio of art for entrance into college or art school. Guidance and instruction on portfolio building will be given with the individual’s goals in mind. Students will be expected to initiate and carry out ideas on a more independent basis, and they will choose their own materials. This course may be taken for up to four semesters, not necessarily sequential, for credit.This course requires teacher approval.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Portfolio Arts 2",
        "Code": "05170G5.0024",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Portfolio 1",
        "Summary": "This second level course is imperative for the student who is preparing a portfolio of art for entrance into college or art school. Guidance and instruction on portfolio building will be given with the individual’s goals in mind. Students will be expected to initiate and carry out ideas on a more independent basis, and they will choose their own materials.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Portfolio Arts 3",
        "Code": "05170G5.0034",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Portfolio 2",
        "Summary": "This third level course is imperative for the student who is preparing an advanced portfolio of art for entrance into college or art school. Guidance and instruction on portfolio building/improving will be given with the individual’s goals in mind. Students will be expected to initiate and carry out ideas on a more independent basis, and they will choose their own materials.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Portfolio Arts 4",
        "Code": "05170G5.0044",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Portfolio 3",
        "Summary": "This fourth level course is imperative for the student who is preparing an advanced portfolio of art for entrance into college or art school. Guidance and instruction on portfolio building/improving will be given with the individual’s goals in mind. Students will be expected to initiate and carry out ideas on a more independent basis, and they will choose their own materials.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Animation",
        "Code": "05177G.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Animation courses focus on the fundamental processes of artistic expression as applied to creative and conceptual aspects of designing and producing two- or three-dimensional animated images for storytelling and multimedia presentations. These courses emphasize the interactive use of drawing and design fundamentals, storyboarding, composition and imaging, audio and sound creation, editing and presentation. Students learn to use various media, techniques, and processes necessary for animation development. Courses may also include a study of the history of animation, its aesthetic issues, and roles and functions. Students engage in critique of their animated work, the animated works of other students, and works by professional animators to reflect on and refine work.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Unified Art",
        "Code": "N/A",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "This course is designed for students with special physical needs. The programs are adaptive in nature and very individualized so that the students can work on their specific needs. Students will increase their skill level in their areas of interest, along with participation in various types of conditioning activities. This course also provides students with the opportunity to participate in modified activities in an environmental education class. This semester course may be repeated as desired or recommended. Mentor students are also able to register. A Mentor Application will be required prior to the start of the class.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Wellness in Action",
        "Code": "08005G5.0046",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "This is the fundamental course for all freshmen, giving them a foundation of knowledge and experience to go forth and make good decisions regarding their wellness. Students will be guided toward looking at their overall wellness (body, mind, and soul) and how to achieve balance within the daily tasks of life. We will emphasize how regular fitness activities are critical to maintaining wellness, and will instruct students on basic training concepts, help them develop good fitness habits, culminating with each student creating and implementing their own fitness plan. Students will be encouraged to explore new fitness activities, expanding their options beyond activities they have done in their youth. Students may take this course second semester and have a different physical education class first semester.",
        "Enjoyment": "10",
        "Difficulty": "1",
        "Workload": "1",
        "Reviews": "1"
    },
    {
        "Name": "Unified PE",
        "Code": "08001G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Wellness in Action",
        "Summary": "This course is designed for students with special physical needs. The programs are adaptive in nature and very individualized so that the students can work on their specific needs. Students will increase their skill level in their areas of interest, along with participation in various types of conditioning activities. This course also provides students with the opportunity to participate in modified activities in an environmental education class. This semester course may be repeated as desired or recommended. Mentor students are also able to register. A Mentor Application will be required prior to the start of the class.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Team Sports",
        "Code": "08002G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Wellness in Action",
        "Summary": "The primary goal of this course is to assist students in developing fundamental skills in various team sports. Students will also learn the history of the sport, rules, etiquette, scoring, strategies, and develop fitness needed for success. Sport areas may include: cricket, lacrosse, ultimate Frisbee, handball, flag football, volleyball, baseball, softball, speedball, soccer, floor hockey, track and field, basketball and team handball.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Aerobic Walking",
        "Code": "08005G5.0016",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Wellness in Action",
        "Summary": "This course is designed for students to have the opportunity to improve their aerobic fitness, primarily through walking. The speed and distance walks are individualized to meet the student’s ability, with an emphasis toward significant, personal improvement. Students will learn about the process of getting fit, with an emphasis on correct walking form, and all the many benefits of walking as a lifelong activity.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Yoga",
        "Code": "08005G5.0066",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Wellness in Action",
        "Summary": "Students will be introduced to many components of yoga including; postures, use of the breath, the flow of postures linked with breath, alignment, and safety. The experience will allow for a progression of growth in each student's ability to do the poses -correctly, safely, more deeply, and longer. Students will be able to incorporate a mind/body connection as they also will feel gain in focus, relaxation, self-confidence, and overall improved awareness of their own body and its health.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Weight Training 1",
        "Code": "08009G5.0012",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Wellness in Action",
        "Summary": "The goal of Weight Training 1 is to provide a knowledge base and practical experience in physical fitness and weight training. Weight training 1 provides a baseline of knowledge for strength training that incorporates the components of fitness and strength training principles.",
        "Enjoyment": "10",
        "Difficulty": "1",
        "Workload": "1",
        "Reviews": "1"
    },
    {
        "Name": "Bowling and Recreational Games",
        "Code": "08004G5.0018",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Wellness in Action",
        "Summary": "The goal of the Bowling and Recreational Games course is to provide a knowledge base and practical experience in lifelong activities. Bowling & other Recreational activities provides a foundation upon which each person can develop skills and knowledge to participate socially or competitively in lifelong physical activities.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Basketball 1",
        "Code": "08013G5.0019",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Wellness in Action",
        "Summary": "The goal of Basketball 1 is to provide a knowledge base and practical experience in playing basketball. Basketball 1 provides a foundation upon which each person can develop fundamental skills to participate leisurely or competitively in the team sport.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Basketball 2",
        "Code": "08013G5.0029",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Wellness in Action",
        "Summary": "The goal of Basketball 2 is to go beyond Basketball 1 providing an advanced knowledge base and competitive experience in lifelong activity. Basketball 2 develops a high level of fitness and builds on the foundation upon which each person can develop skills to participate competitively at a high level.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Racquet Sports",
        "Code": "08013G5.0059",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Wellness in Action",
        "Summary": "The class will include outdoor (tennis) and indoor (badminton, pickle-ball, Ping-Pong) racquet sports. Students will appreciate developing the distinct skills involved in each sport, along with having plenty of opportunity to apply it within game situations as they learn the rules, scoring and etiquette for each sport. This class is an excellent foundation for continuing these activities as lifelong fitness and leisure pursuits.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Volleyball 1",
        "Code": "08013G5.0089",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Wellness in Action",
        "Summary": "Description coming soon…",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Fitness",
        "Code": "08016G5.0022",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Wellness in Action",
        "Summary": "This course will use a comprehensive approach to address all five components of fitness. It will be an opportunity for each person to learn a great deal about fitness and experience personal improvement through a deliberate and challenging progression. Variety will be the key with a broad amount of equipment (bands, dumbbells, fit balls, spin bikes, etc.) and formats (circuits, music, dance, yoga, hiking, fun competitions, etc.).",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Issues in Health",
        "Code": "08079G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Health Education in tenth grade is based on developing skills in relation to age appropriate health topics. By developing skills related to effectively accessing health resources, communicating, analyzing peer and media influences, goal setting, decision making, and health advocacy, students in BVSD will be able to achieve and maintain optimal wellness.",
        "Enjoyment": "8",
        "Difficulty": "1",
        "Workload": "1",
        "Reviews": "2"
    },
    {
        "Name": "Teen Choices",
        "Code": "08099G5.0011",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "In this course, you will learn how to make healthy decisions throughout your teen years. You will learn skills and practices required by individuals to develop, manage and strengthen: social, psychological, and physical wellness, interpersonal relationships, safe sexual decision making, anti-substance use practices, and understanding teens and the law. BVSD Health Curriculum topics will be covered. This course must be taken in the same year as Culinary Nutrition.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Interpersonal Relationships",
        "Code": "19259G5.0011",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "The purpose of the course is to acquire academic knowledge and understanding for healthy, respectful, and caring relationships across the life span. Emphasis is placed on family and friendly dynamics, effective communication, and healthy interpersonal relationships. Membership in the Student Organization FCCLA is an integral part of this program.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Introduction to Health Science",
        "Code": "14002G5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "This two-semester introductory Health Science course provides an overview of the challenging environments and occupation is the healthcare field. This course introduces students to the five pathways that make up the health science cluster (Diagnostic, Therapeutic, and Support Services, Health Informatics, Biotechnology Research and Development). In addition, students are provided a hands-on application of the foundational skills/ knowledge including health maintenance, employability skills, teamwork, healthcare systems, communications, and legal issues in healthcare. This course includes preparation for Basic Life Support for Healthcare Providers certification.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "AP Computer Science Principles",
        "Code": "10019H5.0012",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "AP Computer Science Principles is a college-level introduction to Computer Science topics and the art of computer programming. Students explore a variety of Computer Science topics and learn to develop programs in Python. Students can earn college credit through concurrent enrollment with Front Range Community College and/or by earning a qualifying score on the end of year exam. Students can also prepare and take a Python industry certification. This course is taken in the same year as Intro to Programming: Python.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Introduction to Programming: Python",
        "Code": "CSC 1019",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "This course is taken in the same year as AP Computer Science Principles.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "AP Computer Science A",
        "Code": "10157H5.0012",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "AP Computer Science A is a college-level introduction to Object-Oriented Programming and the Java programming language. Students explore a variety of topics through hands-on projects that help them explore the skills they are learning. Students can earn college credit through concurrent enrollment with Front Range Community College and/or by earning a qualifying score on the end of year exam. At the end of the course, students can prepare for Oracle’s Java Certified Foundations Associate. This course is taken in the same year as Intro to Java Programming.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Introduction to Java Programming",
        "Code": "CSC 1060",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "This course is taken in the same year as AP Computer Science A.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Cyber Security I",
        "Code": "10020G5.0012",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Cybersecurity I provides an introduction to information security with a focus on designing, configuring, and maintaining secure computer networks. The course uses College Board's Career Kickstart Cybersecurity curriculum. Students explore common network vulnerabilities and exploits as they study the OSI and TCP models. Students are also introduced to activities on a cyber range like Capture the Flag (CTF). After this course, students are well-positioned to continue preparing for the CompTIA Network+ certification. This course is taken in the same year as Networking 1: Network+.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Networking 1: Network+",
        "Code": "CNG 1024",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "This course is taken in the same year as Cyber Security I.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Cyber Security II",
        "Code": "10020G5.0022",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Cybersecurity I",
        "Summary": "Cybersecurity Fundamentals builds on the secure networking skills from Cybersecurity 1. The course uses College Board's Career Kickstart Cybersecurity curriculum. Students will continue to learn concepts and skills necessary to secure data and networks, identify and mitigate common security threats, and strengthen the security posture of an organization. Students continue to become familiar with cyber range activities and can choose to participate in cybersecurity competitions. After this course, students are well-prepared to continue preparing for the CompTIA Security+ certification.This course is taken in the same year as Network Security Fundamentals.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Network Security Fundamentals (Cyber II)",
        "Code": "CNG 1032",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "This course is taken in the same year as Cyber Security II.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Work Based Learning: Computer & Digital Technology",
        "Code": "10098G5.0012",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "The Coyote Tech Squad is Monarch HS's in-house Chromebook repair team. Students learn troubleshooting and repair techniques for common issues. Throughout the semester each student works one to two weekly shifts during class time where they resolve fellow students' Chromebook issues. When students are not working a shift, they prepare for industry certifications including CompTIA IT Fundamentals+ and Google Certified IT Professional, among others. As students repeat the course, they pursue additional certifications and receive promotions in their job title and responsibilities.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Career Capstone: Computer & Digital Technology",
        "Code": "10098G5.0022",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Computer Science Capstone is a course for students who have successfully completed AP Computer Science A and are ready to engage in long-term projects to professionalize their skills. Throughout the course of the year, students will collaboratively develop a software solution for a group of stakeholders using a human-centered design process and Agile/Scrum project management methodologies. They also will prepare for an industry certification of their choosing, engage in self-directed professional learning cycles, and build their personal brand by developing a resume and online presence (GitHub and LinkedIn). This course is taken in the same year as .",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Introduction to Business (HSB)",
        "Code": "BUS 1015",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "This project-based business course develops student understanding and skills in such areas as business law, economics, financial analysis, human resources management, information management, marketing, operations, and strategic management. Students acquire an understanding and appreciation of the business world as well as expanding their understanding that businesses are influenced by external factors that are often beyond their control. Consumer spending, government policies, economic conditions, legal issues, and global competition are addressed through practice, current applications to everyday society and business life. Membership in the Student Business Organization, FBLA, is an integral part of the Business program. This course is taken in the same year as HSB Business of Economics",
        "Enjoyment": "8",
        "Difficulty": "3",
        "Workload": "4",
        "Reviews": "1"
    },
    {
        "Name": "HSB Business of Economics",
        "Code": "HSB910G5.0022",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "This project-based business course develops student understanding and skills in such areas as economics, entrepreneurship, operations, and professional development. Through the use of seven projects, students acquire an understanding and appreciation of economic decision making in the business world as well as augmenting their knowledge of entrepreneurial contributions. Current technology will be used to acquire information and to complete the projects. Throughout the course, students are presented problem-solving situations for which they must apply academic and critical-thinking skills. This course is taken in the same year as Introduction to Business.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "HSB Principles of Marketing",
        "Code": "HSB1011G5.12",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Intro to Business & Business of Econ",
        "Summary": "Presents the analysis of theoretical marketing processes and the strategies of product development, pricing, promotion and distribution, and their applications to businesses and the individual consumer. Membership in the student marketing organization, DECA, is an integral part of the Marketing program. This course is taken in the same year as Principles of Marketing (MAR 2016).",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Principles of Marketing (HSB)",
        "Code": "MAR 2016",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Intro to Business & Business of Econ",
        "Summary": "This course is taken in the same year as HSB Principles of Marketing.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Principles of Management (HSB)",
        "Code": "MAN 2026",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "HSB Prin of Mark & Prin of Mark",
        "Summary": "Provides an overview of the principles of management. Emphasis is on the primary functions of planning, organizing, staffing, leading and controlling with a balance between the behavioral and operational approaches. This course is taken in the same year as HSB Business Strategies.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "HSB Business Strategies",
        "Code": "HSB12G5.0022",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "HSB Prin of Mark & Prin of Mark",
        "Summary": "Business Strategies, which is the capstone course for the High School of Business™ program, develops student understanding and skills in such areas as business law, entrepreneurship, financial analysis, human resources management, and strategic management. By planning, organizing, staffing, directing, leading, and controlling business activities, students acquire a realistic understanding of what is required to open and successfully run a business. They conduct situational, market, and competitive analyses; select a target market; develop a business plan; recruit, interview, select, and hire staff; supervise staff; control use of resources; and evaluate the results of the business effort. Throughout the course, students make decisions and use problem-solving skills. Formal reflection is an on-going component of the course. Membership in the Student Business Organization, FBLA, is an integral part of the Business program. This course is taken in the same year as Principles of Management.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Principles of Finance (HSB)",
        "Code": "FIN 2010",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "HSB Prin of Mark & Prin of Mark",
        "Summary": "Provides factual knowledge of financial institutions and the monetary system used in the United States in relationship to the global economy. Examines tools and techniques such as capital budgeting, time value of money, analysis of financial statements, cost of capital, and risk analysis to analyze business decisions, plan and determine project and firm value, and evaluate sources of financing.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Internship (HSB)",
        "Code": "BUS 2081",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "Prin of Manage & HSB Bus Strat",
        "Summary": "Provides continued instruction and the opportunity for students to supplement coursework with practical work experience related to their educational program. Students work under the immediate supervision of experienced personnel at the business location and with the direct guidance of the instructor.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Business Marketing Essentials",
        "Code": "12051G5.0033",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Business and Marketing Essentials (Standard), an introductory business and marketing course, enables students to acquire a realistic understanding of business processes and activities. Students examine fundamental economic concepts, the business environment, and primary business activities. They develop an understanding of and skills in such areas as customer relations, economics, emotional intelligence, financial analysis, human resources management, information management, marketing, operations, professional development, and strategic management. Throughout the course, students are presented ethical dilemmas and problem solving situations for which they must apply academic and critical-thinking skills. This course is taken in the same year as Principles of Marketing.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Principles of Marketing",
        "Code": "12164G5.0022",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Principles of Marketing courses offer students insight into the processes affecting the flow of goods and services from the producer to the consumer. Course content ranges considerably as general marketing principles such as purchasing, distribution, and sales are covered; however, a major emphasis is often placed on kinds of markets; market identification; product planning, packaging, and pricing; and business management. This course is taken in the same year as Business Marketing Essentials.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Intro to Entrepreneurship",
        "Code": "12053G5.0012",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Explores the business skills, personality traits, and commitment necessary to successfully plan, launch, and grow an entrepreneurial venture. This course will cover the challenges and rewards of entrepreneurship. This course will cover the role of entrepreneurial businesses in the United States and the world and their impact on our national and global economy. Membership in the student marketing organization, DECA, is an integral part of the Marketing program. This course is taken in the same year as Strategic Marketing.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Strategic Marketing",
        "Code": "12152G5.0011",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Illustrates the connections between a market-driven strategy, customer satisfaction, and profitable growth. Students will examine how marketing strategies are developed and executed within both small and large organizations. The course will emphasize strategy development, implementation, and evaluation. Membership in the student marketing organization, DECA, is an integral part of the Marketing program. This course is taken in the same year as Intro to Entrepreneurship.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Event Marketing",
        "Code": "12163G5.0012",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Sports and Entertainment Marketing courses provide students with a thorough understanding of fundamental marketing and management concepts and theories as they relate to the sports and entertainment industries. Content may address promotion of sports/events, licensing, sponsorship and endorsements, branding, marketing research, product development, pricing and distribution strategies, sales, event planning, and the role of existing and emerging technologies. These courses may also encourage students to develop job skills and explore career options. This course is taken in the same year as Principles of Advertising.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Principles of Advertising",
        "Code": "12165G5.0011",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Principles of Advertising courses expose students to the varied concepts underlying the promotion of products. The topics included in Principles of Advertising courses range considerably, but typically include the psychology of advertising, a study of various media, advertising planning and budgeting, and advertising layout and design principles. Course topics may also include an overview of commercial art and packaging. This course is taken in the same year as Event Marketing.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Legal Environment of Business",
        "Code": "12054G5.0011",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "What can a business be sued for? What states can a business be sued in? What steps can a business or individual take to avoid that? These are the fundamental questions underlying the course’s exploration of court procedures, contracts, property issues, torts/negligence, copyright, loans, and more. This course takes a hands-on approach to learning the material by introducing students to real world problems and practical solutions for individuals, as well as corporate entities.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Spanish 1",
        "Code": "24052G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Designed to introduce students to Spanish language and culture, Spanish I courses prepare students to communicate authentically in Spanish by interpreting (reading, listening, viewing), exchanging (speaking and listening; reading and writing), and presenting (speaking, writing) information on a variety of topics. They introduce the relationships among the products, practices, and perspectives of Spanish-speaking cultures.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Spanish 2",
        "Code": "24053G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Spanish 1",
        "Summary": "Spanish II courses build upon skills developed in Spanish I, preparing students to communicate authentically in Spanish by interpreting (reading, listening, viewing), exchanging (speaking and listening; reading and writing), and presenting (speaking, writing) information on concrete topics. Spanish II courses introduce the relationships among the products, practices, and perspectives of Spanish-speaking cultures.",
        "Enjoyment": "8",
        "Difficulty": "5",
        "Workload": "4",
        "Reviews": "1"
    },
    {
        "Name": "Spanish 3",
        "Code": "24054G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Spanish 2",
        "Summary": "Level 3 reviews basic grammatical structures and continues the study of more advanced grammar, vocabulary, and culture. Students further develop skills in understanding reading, speaking, and writing through short stories, poetry, articles, oral presentations, and written exercises when applicable. For the Novice-High Range Level, students learn in oral and written form to participate in and comprehend exchanges and present on a variety of topics using familiar vocabulary and learned grammatical structures in the context of Culture, Connections, and Comparisons.",
        "Enjoyment": "7",
        "Difficulty": "2",
        "Workload": "1",
        "Reviews": "1"
    },
    {
        "Name": "Spanish 4",
        "Code": "24055E5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Level 4 explores topics in advanced composition and conversation, with an emphasis on refining and integrating advanced grammar into formal and informal communication. Students develop appropriate language skills required to communicate at a more advanced level. For the Intermediate-Low Range Level, students learn to initiate, sustain and conclude conversations; comprehend spoken or written language; and present on a variety of familiar topics, all using familiar vocabulary and learned grammatical structures in the context of Culture, Connections, and Comparisons.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Spanish Conversation and Composition",
        "Code": "24061E5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Spanish 4",
        "Summary": "Conversation and Composition is taught exclusively in Spanish. It explores topics in advanced composition and conversation, with an emphasis on refining and integrating advanced grammar into daily communication. Emphasis is placed on comprehension as it is spoken and written by native speakers. Students develop appropriate verbs, structures, vocabulary, idioms, and cultural understanding necessary to perform communicative functions at higher levels. For the Intermediate-Mid Range Level, students learn to initiate, sustain and conclude conversations; comprehend spoken or written language; and present on a variety of familiar topics, all using familiar vocabulary and learned grammatical structures in the context of Culture, Connections, and Comparisons.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "AP Spanish Language & Culture",
        "Code": "24064H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Spanish 4",
        "Summary": "Designed by the College Board to parallel third-year college-level courses in Spanish language, AP Spanish Language and Culture courses build upon prior knowledge and develop students’ ability to express ideas, exchange opinions, and present information in Spanish, both orally and in writing. These courses also help students understand and interpret written and spoken Spanish. In addition, students explore the culture of Spanish-speaking people in historical and contemporary contexts.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "French 1",
        "Code": "24102G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Designed to introduce students to French language and culture, French I courses prepare students to communicate authentically in French by interpreting (reading, listening, viewing), exchanging (speaking and listening; reading and writing), and presenting (speaking, writing) information on a variety of topics. They introduce the relationships among the products, practices, and perspectives of French-speaking cultures.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "French 2",
        "Code": "24103G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "French 1",
        "Summary": "French II courses build upon skills developed in French I, preparing students to communicate authentically in French by interpreting (reading, listening, viewing), exchanging (speaking and listening; reading and writing), and presenting (speaking, writing) information on concrete topics. French II courses introduce the relationships among the products, practices, and perspectives of French-speaking cultures.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "French 3",
        "Code": "24104G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "French 2",
        "Summary": "French III courses prepare students to communicate authentically in French by interpreting (reading, listening, viewing), exchanging (speaking and listening; reading and writing), and presenting (speaking, writing) information, concepts, and ideas on a variety of topics, including connections to other subject areas. These courses expand students’ knowledge of relationships among the products, practices, and perspectives of French-speaking countries and cultures.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "ADV French 4",
        "Code": "24105E5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "French 3",
        "Summary": "This course, taught exclusively in French, explores the IB core topics of Social Relations, Communication and Media and Global Themes by intensive practice in advanced composition and conversation, with an emphasis on refining and integrating advanced grammar into daily communication. Emphasis will be placed on comprehension of authentic text genres and visual thematic images and the ability to respond appropriately in varying registers both in writing and orally. Students will develop verb usage, grammatical structures, vocabulary, idioms and cultural understanding necessary to communicate in a global society at an advanced level.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "AP French",
        "Code": "24114H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "French 4",
        "Summary": "Designed by the College Board to parallel third-year college-level courses in French language, AP French Language and Culture courses build upon prior knowledge and develop students’ ability to express ideas, exchange opinions, and present information in French, both orally and in writing. These courses also help students understand and interpret written and spoken French. In addition, students explore the culture of French-speaking people in historical and contemporary contexts.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "German 1",
        "Code": "24252G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Designed to introduce students to German language and culture, German I courses prepare students to communicate authentically in German by interpreting (reading, listening, viewing), exchanging (speaking and listening; reading and writing), and presenting (speaking, writing) information on a variety of topics. They introduce the relationships among the products, practices, and perspectives of German-speaking cultures.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "German 2",
        "Code": "24253G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "German 1",
        "Summary": "German II courses build upon skills developed in German I, preparing students to communicate authentically in German by interpreting (reading, listening, viewing), exchanging (speaking and listening; reading and writing), and presenting (speaking, writing) information on concrete topics. German II courses introduce the relationships among the products, practices, and perspectives of German-speaking cultures.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "German 3",
        "Code": "24254G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "German 2",
        "Summary": "German III courses prepare students to communicate authentically in German by interpreting (reading, listening, viewing), exchanging (speaking and listening; reading and writing), and presenting (speaking, writing) information, concepts, and ideas on a variety of topics, including connections to other subject areas. These courses expand students’ knowledge of relationships among the products, practices, and perspectives of German-speaking countries and cultures.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "ADV German 3",
        "Code": "24254E5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "German 2",
        "Summary": "The German 3 Advanced / Pre-AP course provides students with in-depth prerequisite knowledge that articulates with the current AP German curriculum. Students will become well versed in the AP course framework of six overarching modern themes (Global Challenges; Science and Technology; Beauty and Aesthetics; Families and Communities; Personal and Public Identities; and Contemporary Life), gain a deeper understanding of European/global perspectives, and work toward mastering the more complex aspects of the German language. Students will practice identifying main points, significant details, purpose, and intended audience for a variety of authentic graphs, texts and audio/video materials and making inferences and predictions based on them. They will write spontaneous interpersonal messages and polished presentational essays, and will practice conversational and presentational speaking skills. As an advanced course, this course goes beyond the curriculum expectations of a standard level 3 German course offering by increasing the depth and complexity, and it is intended to prepare a student to enroll in Advanced Placement German the following year.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "ADV German 4",
        "Code": "24255E5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "German 3 or Adv German 3",
        "Summary": "Level 4 explores topics in advanced composition and conversation, with an emphasis on refining and integrating advanced grammar into formal and informal communication. Students develop appropriate language skills required to communicate at a more advanced level. For the Intermediate-Low Range Level, students learn to initiate, sustain and conclude conversations; comprehend spoken or written language; and present on a variety of familiar topics, all using familiar vocabulary and learned grammatical structures in the context of Culture, Connections, and Comparisons.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "AP German",
        "Code": "24263H5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "German 4",
        "Summary": "Designed by the College Board to parallel third-year college-level courses in German language, AP German Language and Culture courses build upon prior knowledge and develop students’ ability to express ideas, exchange opinions, and present information in German, both orally and in writing. These courses also help students understand and interpret written and spoken German. In addition, students explore the culture of German-speaking people in historical and contemporary contexts.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "ASL 1",
        "Code": "24852G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Designed to introduce students to American Sign Language language and culture, American Sign Language I courses prepare students to communicate authentically in American Sign Language by interpreting (reading/viewing), exchanging (signing and reading), and presenting (signing) information on a variety of topics. They introduce the relationship among the practices, perspectives, and cultures of deaf people and communities.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "ASL 2",
        "Code": "24853G5.0012",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "ASL 1",
        "Summary": "American Sign Language II courses build upon skills developed in American Sign Language I, preparing students to communicate authentically in American Sign Language by interpreting (reading/viewing), exchanging (signing and reading), and presenting (signing) information on concrete topics. American Sign Language II courses introduce the relationship among the practices, perspectives, and cultures of deaf people and communities. This course is taken in the same year as American Sign Language II.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "American Sign Language II",
        "Code": "ASL 1122",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "ASL 1",
        "Summary": "This course is taken in the same year as ASL 2.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "ASL 3",
        "Code": "24854G5.0012",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "ASL 2",
        "Summary": "American Sign Language III courses prepare students to communicate authentically in American Sign Language by interpreting (reading/viewing), exchanging (signing and reading), and presenting (signing) information, concepts, and ideas on a variety of topics, including connections to other subject areas. These courses expand students’ knowledge of relationships among the practices, perspectives, and cultures of deaf people and communities. This course is taken in the same year as American Sign Language III.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "American Sign Language III",
        "Code": "ASL 1123",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "ASL 2",
        "Summary": "This course is taken in the same year as ASL 3 .",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "ADV ASL 4",
        "Code": "24855E5.0012",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "ASL 3",
        "Summary": "American Sign Language IV courses prepare students to communicate authentically in American Sign Language by interpreting (reading/viewing), exchanging (signing and reading), and presenting (signing) information, concepts, and ideas on a variety of topics, including connections to other subject areas. American Sign Language IV courses promote students’ understanding of the relationships among the practices, perspectives, and cultures of deaf people and communities. This course is taken in the same year as American Sign Language IV.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "American Sign Language IV",
        "Code": "ASL 2221",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "ASL 3",
        "Summary": "This course is taken in the same year as ASL 4.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Culinary Nutrition",
        "Code": "16054G5.0011",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "The purpose of this course is to develop lifelong, healthy individuals with an understanding of healthy and nutritious preparation techniques utilizing various resources and skills. Emphasis is placed on implementing healthy nutritional choices, preparing nutrient-dense seasonal foods, sports nutrition, exploring careers related to culinary nutrition, and practicing wise consumerism. Membership in the Student Organization FCCLA is an integral part of this program. This course must be taken in the same year as Teen Choices.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Culinary Essentials I",
        "Code": "10653G5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "This course is designed to introduce students to a variety of culinary skills and food preparation. Through instruction and culinary lab practice, this class will provide an opportunity for students to learn food preparation and demonstrate food safety. Some topics include introductory culinary skills and preparation of items such as quick breads, yeast breads, and eggs; as well as meal and menu planning, nutrition, and food borne illnesses. Students will be able to: Demonstrate the correct procedures’ and techniques in introductory culinary labs. Analyze nutritional guidelines and plan menus that are nutritionally balanced. Demonstrate food safety standards.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Life Management",
        "Code": "19257G5.0011",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "The purpose of this course is to develop empowered individuals to help you sharpen your focus on your own life. It is to help you gain a clear picture of who you are, how you got that way, and most importantly, to help you make wise choices in your life. Topics include: relationships, communication, healthy lifestyle, food and nutrition, and preparing for life after high school. Membership in the Student Organization FCCLA is an integral part of this program. This course must be taken in the same year as Interpersonal Relationships.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Introduction to Aviation & Aerospace",
        "Code": "20053G5.0089/99",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Aviation is a massive industry filled with all sorts of fascinating and complex issues along with tremendous career opportunities. In this introductory course, students learn about the engineering process, problem solving, and the innovations and technological developments that have made today’s aviation and aerospace industries possible. The course begins with a historical perspective from the earliest flying machines to the wide variety of modern aircraft and the integral role they play in making today’s world work. Later topics cover modern aviation and aerospace technologies and consideration of the future of air and space travel. Students conduct hands-on activities including creating hot air balloons, testing airfoils, and even prototyping space capsules.",
        "Enjoyment": "10",
        "Difficulty": "2",
        "Workload": "2",
        "Reviews": "1"
    },
    {
        "Name": "Aerodynamics",
        "Code": "20053G5.0019",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Students will begin with an exploration of the types of aircraft in use today before going on to the physics of flight. The course covers the forces of flight—lift, weight, thrust, and drag—in depth, including how to make key calculations. Students also consider touch on aircraft design, looking at stability, aircraft controls, and maneuvering flight. Material covered in this course is similar to concepts tested on the FAA Private Pilot and sUAS (drone) written exams. Curriculum is provided by the Aircraft Owners and Pilots Association. Prior completion of Introduction to Aviation & Aerospace A/B recommended but not required. This course is taken in the same year as Principles of Flight.",
        "Enjoyment": "8",
        "Difficulty": "4",
        "Workload": "4",
        "Reviews": "2"
    },
    {
        "Name": "Principles of Flight",
        "Code": "20053G5.0059",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Examines the systems that make manned and unmanned aircraft work. Beginning with aircraft propulsion, students learn about the different types of engines that produce thrust to propel an aircraft or UAS. The course explores other key aircraft components, including fuel, electrical, landing gear, and environmental systems. In order to fly an aircraft safely, students learn about the flight instruments associated with each system and how to identify and troubleshoot common problems. Finally, the course considers factors that affect aircraft performance and how to determine critical operating data for aircraft. Material covered in this course is similar to concepts tested on the FAA Private Pilot and sUAS (drone) written exams. Curriculum is provided by the Aircraft Owners and Pilots Association. This course must be taken in the same year as Aerodynamics.",
        "Enjoyment": "9",
        "Difficulty": "5",
        "Workload": "3",
        "Reviews": "1"
    },
    {
        "Name": "Aviation Weather",
        "Code": "20053G5.0069",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Covers basic theory of global circulation and the development of weather patterns with an emphasis on phenomena that are particularly hazardous for aviation. Students also learn how to access and interpret weather information intended for the flying environment. Airport markings and operations are also covered, as are pilot communication basics. Material covered in this course is similar to concepts tested on the FAA Private Pilot and sUAS (drone) written exams. Curriculum is provided by the Aircraft Owners and Pilots Association. Prior completion of Introduction to Aviation & Aerospace recommended but not required. This course is taken in the same year as Advanced Flight.",
        "Enjoyment": "9",
        "Difficulty": "3",
        "Workload": "2",
        "Reviews": "1"
    },
    {
        "Name": "Advanced Flight",
        "Code": "20053G5.0079",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Students learn to interpret and use aeronautical charts for flight planning and navigation. The course covers airspace classes, information about special uses of airspace, and how to use basic flight planning tools. Aeromedical factors and important federal aviation regulations will be considered. Material covered in this course is similar to concepts tested on the FAA Private Pilot written exam. Curriculum is provided by the Aircraft Owners and Pilots Association. Prior completion of Introduction to Aviation & Aerospace A/B recommended but not required. This course is taken in the same year as Aviation Weather.",
        "Enjoyment": "10",
        "Difficulty": "1",
        "Workload": "1",
        "Reviews": "1"
    },
    {
        "Name": "Introduction to Engineering Design",
        "Code": "21006G5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Introduction to Engineering Design is a fundamental course in the Engineering and Technology Program of Study for students interested in developing their skills in preparation for careers in engineering and technology. The course covers essential knowledge, skills, and concepts required for postsecondary engineering and technology fields of study. Upon completion of this course, proficient students are able to describe various engineering disciplines, as well as admissions requirements for postsecondary engineering and engineering technology programs in Colorado. They will also be able to identify simple and complex machines, calculate various ratios related to mechanisms, explain fundamental concepts related to energy, understand Ohm’s Law, follow the steps in the engineering design process to complete a team project, and effectively communicate design solutions to others. Membership in the Student Organization TSA is an integral part of this program.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "PLTW: Computer Integrated Manufacturing",
        "Code": "21022G5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Intro to Engineering",
        "Summary": "The course deepens the skills and knowledge of an engineering student within the context of efficiently creating the products all around us. Students build upon their Computer Aided Design (CAD) experience through the use of Computer Aided Manufacturing (CAM) software. CAM transforms a digital design into a program that a Computer Numerical Controlled (CNC) mill uses to transform a block of raw material into a product designed by a student. Students learn and apply concepts related to integrating robotic systems such as Automated Guided Vehicles (AGV) and robotic arms into manufacturing systems. Membership in the Student Organization TSA is an integral part of this program.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "PLTW: Engineering Design & Development",
        "Code": "21025G5.0012/22",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "Intro to Engineering",
        "Summary": "In this capstone course, students will work mostly in teams to design and construct the solution to an engineering problem, applying the principles developed in preceding engineering courses. The problems will involve a wide range of engineering applications. Each student will be responsible for delivering progress reports and making various presentations of their project for an outside review panel of practicing engineers and scientists.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Wilderness First Aid",
        "Code": "OUT 2043",
        "Weighted": "true",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "This course within the Outdoor Leadership Pathway is an introduction to wilderness medicine and basic life support skills. The course teaches students the skills to anticipate risks and hazards, identify medical, traumatic, environmental health problems, recognize life-threatening issues, initiate basic first aid care and CPR, make evacuation decisions and deliver a cohesive report. Students will also spend a smaller portion of the semester learning some basic outdoor skills such as backcountry trip planning, prep and packing, risk mitigation, knot tying, leave no trace principles and more. This hands-on curriculum forces students to think creatively, adapt to ever changing situations, and learn valuable leadership, decision making, and communication skills. Students in this class will hear from industry guest speakers and be eligible to receive 1 free college credit and Wilderness First Aid and CPR+AED certifications for a \\$90 additional fee (financial assistance available)",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Criminal Law",
        "Code": "15057G5.0022",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "This course will focus on Criminal Law emphasizing the understanding of what a criminal law is, how it is enacted, how crime is studied by social scientists and how crime is explained. The students will gain an understanding of the elements of crimes, what the elements mean and what these elements reveal about human nature. This course will walk students through cases around crimes against person, robbery and burglary, narcotic and alcohol offenses, domestic violence offenses, sex crimes, disorderly conduct and sentencing and punishment.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Academic Assistant",
        "Code": "22051G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "This elective provides the opportunity for students to support a teacher at Monarch K-8, working with students of differing age levels. Students will have one teacher mentor and assist in the classroom for the semester.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Academic Peer Instructor",
        "Code": "22054G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "This elective course would afford ninth - twelfth grade students the opportunity to mentor students with disabilities during the school day for one course period daily. It would also provide course content through regular meetings in the following areas: diversity awareness relevant to disabilities, knowledge of disability categories, information regarding modifications and accommodations, typical learning styles and skills development, universal design, inclusive practices, accessibility issues, and special education policies and procedures.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Leadership (Peer Ambassadors)",
        "Code": "22101G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Peer Ambassadors help new students transition to Monarch and connect to the school community. Ambassadors help with special events such as new student orientation, college fairs, student and family individual tours and open enrolment night. This course can be taken during the school day or as an extracurricular activity.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Career Internship",
        "Code": "22998G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Workplace Experience courses provide students with work experience in a field related to their interests. Goals are typically set cooperatively by the student, teacher, and employer (although students are not necessarily paid). These courses may include classroom activities as well, involving further study of the field or discussion regarding experiences that students encounter in the workplace. Note: Students must find their own internship. This course is a way to also receive high school credit. The Student Support Courses at Monarch can not be elected by students or families, but will be assigned by administration for the appropriate need.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Pre-Algebra Intervention",
        "Code": "02051G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Pre-Algebra courses increase students' foundational mathematics skills and prepare them for Algebra I by covering a variety of topics, such as properties of rational numbers (i.e., number theory), ratio, proportion, estimation, exponents and radicals, the rectangular coordinate system, sets and logic, formulas, and solving first-degree equations and inequalities.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Reading Wrkshp",
        "Code": "01066G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Reading Workshop",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "CLDE Application & Transition - Eng 9",
        "Code": "09CLDEG5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Students will develop speaking, listening, reading and writing skills in English that meet or exceed Can Do Descriptors for WIDA Proficiency Levels 1-6, Entering through Reaching. Students will also develop basic technology skills (email, Google apps, etc.) as well as a general understanding of the expectations and requirements of the U.S. high school system, and preparation for postsecondary education and career planning. This course will provide specific support for students within their first and second years of high school. Particular focus will be paid to assisting students to experience success throughout their high school career. Students work independently and as a class to explore the following themes: Identity and Belonging, Global Citizenship, School Success, and Post-Secondary Readiness.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "CLDE Application & Transition - Eng 10",
        "Code": "10CLDEG5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Students will develop speaking, listening, reading and writing skills in English that meet or exceed Can Do Descriptors for WIDA Proficiency Levels 1-6, Entering through Reaching. Students will also develop basic technology skills (email, Google apps, etc.) as well as a general understanding of the expectations and requirements of the U.S. high school system, and preparation for postsecondary education and career planning. This course will provide specific support for students within their first and second years of high school. Particular focus will be paid to assisting students to experience success throughout their high school career. Students work independently and as a class to explore the following themes: Identity and Belonging, Global Citizenship, School Success, and Post-Secondary Readiness.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "CLDE Application & Transition - Eng 11",
        "Code": "11CLDEG5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Students will develop speaking, listening, reading and writing skills in English that meet or exceed Can Do Descriptors for WIDA Proficiency Levels 1-6, Entering through Reaching. Students will also develop basic technology skills (email, Google apps, etc.) as well as a general understanding of the expectations and requirements of the U.S. high school system, and preparation for postsecondary education and career planning. This course will provide specific support for students within their first and second years of high school. Particular focus will be paid to assisting students to experience success throughout their high school career. Students work independently and as a class to explore the following themes: Identity and Belonging, Global Citizenship, School Success, and Post-Secondary Readiness.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "CLDE ASC",
        "Code": "ASCCLDG5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Students will communicate information, ideas, and concepts necessary for academic success in the content areas of Language Arts, Mathematics, Science, and Social Studies. The teacher will support students individually and in small groups to develop the prerequisite content skills and language forms and functions necessary for graduation and beyond. Through direct language instruction, literacy and math interventions and self-paced learning, ASC will provide a supportive environment in which students will gain the essential skills necessary in support of grade level content area classes.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "CLDE Senior Seminar- Communications",
        "Code": "COMCLDG5.OO12/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "The CLDE Seminar Course is a class that 12th grade students who are on track to graduate will take to help them to complete the CLDE Capstone Pathway towards graduation. This course is designed to specifically support students in meeting the CLDE capstone graduation pathway requirements. Students work independently and as a class to explore the following themes: Identity and Belonging, Global Citizenship, School Success, and Post-Secondary Readiness. All of the work that students complete in this course should be rooted in a perspective of Ethnic Studies, so that students may continue to build pride and self-efficacy in their identity as an Emerging Bilingual.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "CLDE Seminar- LA Elective",
        "Code": "LECLDG5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "Description coming soon…",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "AVID 9",
        "Code": "22007G5.0018/28",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "AVID (Advancement Via Individual Determination) AVID is a college preparatory program that focuses on students who are academically proficient, yet need support in reaching and succeeding in advanced academic courses. AVID bridges student gaps in the skills, language, habits, and resources of the college-bound student. Additionally, students in AVID receive academic and motivational support. Other aspects of the program include: field trips to places of educational and cultural interest and tutoring by college students. Application and interview is required prior to enrollment.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "AVID 10",
        "Code": "22007G5.0038/48",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "AVID (Advancement Via Individual Determination) AVID is a college preparatory program that focuses on students who are academically proficient, yet need support in reaching and succeeding in advanced academic courses. AVID bridges student gaps in the skills, language, habits, and resources of the college-bound student. Additionally, students in AVID receive academic and motivational support. Other aspects of the program include: field trips to places of educational and cultural interest and tutoring by college students. Application and interview is required prior to enrollment.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "AVID 11",
        "Code": "22007G5.0058/68",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "AVID (Advancement Via Individual Determination) AVID is a college preparatory program that focuses on students who are academically proficient, yet need support in reaching and succeeding in advanced academic courses. AVID bridges student gaps in the skills, language, habits, and resources of the college-bound student. Additionally, students in AVID receive academic and motivational support. Other aspects of the program include: field trips to places of educational and cultural interest and tutoring by college students. Application and interview is required prior to enrollment.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "AVID 12",
        "Code": "22007G5.0078/88",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "AVID (Advancement Via Individual Determination) AVID is a college preparatory program that focuses on students who are academically proficient, yet need support in reaching and succeeding in advanced academic courses. AVID bridges student gaps in the skills, language, habits, and resources of the college-bound student. Additionally, students in AVID receive academic and motivational support. Other aspects of the program include: field trips to places of educational and cultural interest and tutoring by college students. Application and interview is required prior to enrollment.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Office Assistant",
        "Code": "22052G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Office Aide courses provide students with the opportunity to work in campus offices, developing skills related to clerical office work. Duties may include typing, filing, record-keeping, receiving visitors, answering the telephone, and duplicating, among others. These courses emphasize appropriate work attitudes, human relations, and proper office procedures.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Academic Peer Instructor",
        "Code": "22054G5.0012/22",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "2",
        "Prerequisites": "N/A",
        "Summary": "This elective course would afford ninth - twelfth grade students the opportunity to mentor students with disabilities during the school day for one course period daily. It would also provide course content through regular meetings in the following areas: diversity awareness relevant to disabilities, knowledge of disability categories, information regarding modifications and accommodations, typical learning styles and skills development, universal design, inclusive practices, accessibility issues, and special education policies and procedures.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Student Council",
        "Code": "22103G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "School Governance courses convene students as an entire student body to discuss common concerns, organize groups for action, make decisions, and solve school-related problems. Because of the nature of these courses, they are typically offered at private, alternative, or experimental schools.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    },
    {
        "Name": "Advisory",
        "Code": "22106G5.0011",
        "Weighted": "false",
        "Credits": "5",
        "Semesters": "1",
        "Prerequisites": "N/A",
        "Summary": "Seminar courses vary widely, but typically offer a small peer group the opportunity to investigate areas of interest. Course objectives may include improvement of research and investigatory skills, presentation skills, interpersonal skills, group process skills, and problem-solving and critical-thinking skills. Seminars aimed at juniors and seniors often include a college and career exploration and planning component.",
        "Enjoyment": "N/A",
        "Difficulty": "N/A",
        "Workload": "N/A",
        "Reviews": "0"
    }
]